Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: أم يحسدون الناس على ما آتاهم الله من فضله فقد آتينا آل إبراهيم الكتاب والحكمة وآتيناهم ملكا عظيما
en: Or do they envy men (Muhammad صلى الله عليه وسلم and his followers) for what Allah has given them of His Bounty? Then We had already given the family of Ibrahim (Abraham) the Book and Al-Hikmah (As-Sunnah - Divine Revelation to those Prophets not written in the form of a book), and conferred upon them a great kingdom.

source: فمنهم من آمن به ومنهم من صد عنه وكفى بجهنم سعيرا
en: Of them were (some) who believed in him (Muhammad صلى الله عليه وسلم), and of them were (some) who averted their faces from him (Muhammad صلى الله عليه وسلم); and enough is Hell for burning (them) .

source: إن الذين كفروا بآياتنا سوف نصليهم نارا كلما نضجت جلودهم بدلناهم جلودا غيرها ليذوقوا العذاب إن الله كان عزيزا حكيما
en: Surely! Those who disbelieved in Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), We shall burn them in Fire. As often as their skins are roasted through, We shall change them for other skins that they may taste the punishment. Truly, Allah is Ever Most Powerful, All-Wise.

source: والذين آمنوا وعملوا الصالحات سندخلهم جنات تجري من تحتها الأنهار خالدين فيها أبدا لهم فيها أزواج مطهرة وندخلهم ظلا ظليلا
en: But those who believe (in the Oneness of Allah - Islamic Monotheism) and do deeds of righteousness, We shall admit them to Gardens under which rivers flow (Paradise), abiding therein forever. Therein they shall have Azwajun Mutahharatun (purified mates or wives), and We shall admit them to shades wide and ever deepening (Paradise) .

source: إن الله يأمركم أن تؤدوا الأمانات إلى أهلها وإذا حكمتم بين الناس أن تحكموا بالعدل إن الله نعما يعظكم به إن الله كان سميعا بصيرا
en: Verily! Allah commands that you should render back the trusts to those to whom they are due; and that when you judge between men, you judge with justice. Verily, how excellent is the teaching which He (Allah) gives you! Truly, Allah is Ever All-Hearer, All-Seer.

source: يا أيها الذين آمنوا أطيعوا الله وأطيعوا الرسول وأولي الأمر منكم فإن تنازعتم في شيء فردوه إلى الله والرسول إن كنتم تؤمنون بالله واليوم الآخر ذلك خير وأحسن تأويلا
en: O you who believe! Obey Allah and obey the Messenger (Muhammad صلى الله عليه وسلم), and those of you (Muslims) who are in authority. (And) if you differ in anything amongst yourselves, refer it to Allah and His Messenger (صلى الله عليه وسلم), if you believe in Allah and in the Last Day. That is better and more suitable for final determination.

source: ألم تر إلى الذين يزعمون أنهم آمنوا بما أنزل إليك وما أنزل من قبلك يريدون أن يتحاكموا إلى الطاغوت وقد أمروا أن يكفروا به ويريد الشيطان أن يضلهم ضلالا بعيدا
en: Have you not seen those (hypocrites) who claim that they believe in that which has been sent down to you, and that which was sent down before you, and they wish to go for judgement (in their disputes) to the Taghut (false judges) while they have been ordered to reject them. But Shaitan (Satan) wishes to lead them far astray .

source: وإذا قيل لهم تعالوا إلى ما أنزل الله وإلى الرسول رأيت المنافقين يصدون عنك صدودا
en: And when it is said to them: "Come to what Allah has sent down and to the Messenger (Muhammad صلى الله عليه وسلم)," you (Muhammad صلى الله عليه وسلم) see the hypocrites turn away from you (Muhammad صلى الله عليه وسلم) with aversion.

source: فكيف إذا أصابتهم مصيبة بما قدمت أيديهم ثم جاءوك يحلفون بالله إن أردنا إلا إحسانا وتوفيقا
en: How then, when a catastrophe befalls them because of what their hands have sent forth, they come to you swearing by Allah, "We meant no more than goodwill and conciliation!"

source: أولئك الذين يعلم الله ما في قلوبهم فأعرض عنهم وعظهم وقل لهم في أنفسهم قولا بليغا
en: They (hypocrites) are those of whom Allah knows what is in their hearts; so turn aside from them (do not punish them) but admonish them, and speak to them an effective word (i.e. to believe in Allah, worship Him, obey Him, and be afraid of Him) to reach their innerselves.

source: وما أرسلنا من رسول إلا ليطاع بإذن الله ولو أنهم إذ ظلموا أنفسهم جاءوك فاستغفروا الله واستغفر لهم الرسول لوجدوا الله توابا رحيما
en: We sent no Messenger, but to be obeyed by Allah's Leave. If they (hypocrites), when they had been unjust to themselves, had come to you (Muhammad صلى الله عليه وسلم) and begged Allah's Forgiveness, and the Messenger had begged forgiveness for them: indeed, they would have found Allah All-Forgiving (One Who forgives and accepts repentance), Most Merciful.

source: فلا وربك لا يؤمنون حتى يحكموك فيما شجر بينهم ثم لا يجدوا في أنفسهم حرجا مما قضيت ويسلموا تسليما
en: But no, by your Lord, they can have no Faith, until they make you (O Muhammad صلى الله عليه وسلم) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission.

source: ولو أنا كتبنا عليهم أن اقتلوا أنفسكم أو اخرجوا من دياركم ما فعلوه إلا قليل منهم ولو أنهم فعلوا ما يوعظون به لكان خيرا لهم وأشد تثبيتا
en: And if We had ordered them (saying), "Kill yourselves (i.e. the innocent ones kill the guilty ones) or leave your homes," very few of them would have done it; but if they had done what they were told, it would have been better for them, and would have strengthened their (Faith);

source: وإذا لآتيناهم من لدنا أجرا عظيما
en: And indeed We should then have bestowed upon them a great reward from Ourselves.

source: ولهديناهم صراطا مستقيما
en: And indeed We should have guided them to the Straight Way.

source: ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين وحسن أولئك رفيقا
en: And whoso obey Allah and the Messenger (Muhammad صلى الله عليه وسلم), then they will be in the company of those on whom Allah has bestowed His Grace, of the Prophets, the Siddiqun (those followers of the Prophets who were first and foremost to believe in them, like Abu Bakr As-Siddiq (رضي الله عنه), the martyrs, and the righteous. And how excellent these companions are!

source: ذلك الفضل من الله وكفى بالله عليما
en: Such is the Bounty from Allah, and Allah is Sufficient as All-Knower.

source: يا أيها الذين آمنوا خذوا حذركم فانفروا ثبات أو انفروا جميعا
en: O you who believe! Take your precautions, and either go forth (on an expedition) in parties, or go forth all together.

source: وإن منكم لمن ليبطئن فإن أصابتكم مصيبة قال قد أنعم الله علي إذ لم أكن معهم شهيدا
en: There is certainly among you he who would linger behind (from fighting in Allah's Cause). If a misfortune befalls you, he says, "Indeed Allah has favoured me in that I was not present among them."

source: ولئن أصابكم فضل من الله ليقولن كأن لم تكن بينكم وبينه مودة يا ليتني كنت معهم فأفوز فوزا عظيما
en: But if a bounty (victory and booty) comes to you from Allah, he would surely say - as if there had never been ties of affection between you and him - "Oh! I wish I had been with them; then I would have achieved a great success (a good share of booty)."

source: فليقاتل في سبيل الله الذين يشرون الحياة الدنيا بالآخرة ومن يقاتل في سبيل الله فيقتل أو يغلب فسوف نؤتيه أجرا عظيما
en: Let those (believers) who sell the life of this world for the Hereafter fight in the Cause of Allah, and whoso fights in the Cause of Allah, and is killed or gets victory, We shall bestow on him a great reward.

source: وما لكم لا تقاتلون في سبيل الله والمستضعفين من الرجال والنساء والولدان الذين يقولون ربنا أخرجنا من هذه القرية الظالم أهلها واجعل لنا من لدنك وليا واجعل لنا من لدنك نصيرا
en: And what is wrong with you that you fight not in the Cause of Allah, and for those weak, ill-treated and oppressed among men, women, and children, whose cry is: "Our Lord! Rescue us from this town whose people are oppressors; and raise for us from You one who will protect, and raise for us from You one who will help."

source: الذين آمنوا يقاتلون في سبيل الله والذين كفروا يقاتلون في سبيل الطاغوت فقاتلوا أولياء الشيطان إن كيد الشيطان كان ضعيفا
en: Those who believe, fight in the Cause of Allah, and those who disbelieve, fight in the cause of Taghut (Satan). So fight you against the friends of Shaitan (Satan). Ever feeble indeed is the plot of Shaitan (Satan).

source: ألم تر إلى الذين قيل لهم كفوا أيديكم وأقيموا الصلاة وآتوا الزكاة فلما كتب عليهم القتال إذا فريق منهم يخشون الناس كخشية الله أو أشد خشية وقالوا ربنا لم كتبت علينا القتال لولا أخرتنا إلى أجل قريب قل متاع الدنيا قليل والآخرة خير لمن اتقى ولا تظلمون فتيلا
en: Have you not seen those who were told to hold back their hands (from fighting) and perform As-Salat (Iqamat-as-Salat), and give Zakat but when the fighting was ordained for them, behold! a section of them fear men as they fear Allah or even more. They say: "Our Lord! Why have you ordained for us fighting? Would that You had granted us respite for a short period?" Say: "Short is the enjoyment of this world. The Hereafter is (far) better for him who fears Allah, and you shall not be dealt with unjustly even equal to a scalish thread in the long slit of a date-stone.

source: أينما تكونوا يدرككم الموت ولو كنتم في بروج مشيدة وإن تصبهم حسنة يقولوا هذه من عند الله وإن تصبهم سيئة يقولوا هذه من عندك قل كل من عند الله فمال هؤلاء القوم لا يكادون يفقهون حديثا
en: "Wheresoever you may be, death will overtake you even if you are in fortresses built up strong and high!" And if some good reaches them, they say, "This is from Allah," but if some evil befalls them, they say, "This is from you (O Muhammad صلى الله عليه وسلم)." Say: "All things are from Allah," so what is wrong with these people that they fail to understand any word?

source: ما أصابك من حسنة فمن الله وما أصابك من سيئة فمن نفسك وأرسلناك للناس رسولا وكفى بالله شهيدا
en: Whatever of good reaches you, is from Allah, but whatever of evil befalls you, is from yourself. And We have sent you (O Muhammad صلى الله عليه وسلم) as a Messenger to mankind, and Allah is Sufficient as a Witness.

source: من يطع الرسول فقد أطاع الله ومن تولى فما أرسلناك عليهم حفيظا
en: He who obeys the Messenger (Muhammad صلى الله عليه وسلم), has indeed obeyed Allah, but he who turns away, then we have not sent you (O Muhammad صلى الله عليه وسلم) as a watcher over them.

source: ويقولون طاعة فإذا برزوا من عندك بيت طائفة منهم غير الذي تقول والله يكتب ما يبيتون فأعرض عنهم وتوكل على الله وكفى بالله وكيلا
en: They say: "We are obedient," but when they leave you (Muhammad صلى الله عليه وسلم), a section of them spend all night in planning other than what you say. But Allah records their nightly (plots). So turn aside from them (do not punish them), and put your trust in Allah. And Allah is Ever All-Sufficient as a Disposer of affairs.

source: أفلا يتدبرون القرآن ولو كان من عند غير الله لوجدوا فيه اختلافا كثيرا
en: Do they not then consider the Qur'an carefully? Had it been from other than Allah, they would surely have found therein many a contradiction.

source: وإذا جاءهم أمر من الأمن أو الخوف أذاعوا به ولو ردوه إلى الرسول وإلى أولي الأمر منهم لعلمه الذين يستنبطونه منهم ولولا فضل الله عليكم ورحمته لاتبعتم الشيطان إلا قليلا
en: When there comes to them some matter touching (public) safety or fear, they make it known (among the people); if only they had referred it to the Messenger or to those charged with authority among them, the proper investigators would have understood it from them (directly). Had it not been for the Grace and Mercy of Allah upon you, you would have followed Shaitan (Satan), save a few of you.

source: فقاتل في سبيل الله لا تكلف إلا نفسك وحرض المؤمنين عسى الله أن يكف بأس الذين كفروا والله أشد بأسا وأشد تنكيلا
en: Then fight (O Muhammad صلى الله عليه وسلم) in the Cause of Allah, you are not tasked (held responsible) except for yourself, and incite the believers (to fight along with you), it may be that Allah will restrain the evil might of the disbelievers. And Allah is Stronger in Might and Stronger in punishing.

source: من يشفع شفاعة حسنة يكن له نصيب منها ومن يشفع شفاعة سيئة يكن له كفل منها وكان الله على كل شيء مقيتا
en: Whosoever intercedes for a good cause will have the reward thereof, and whosoever intercedes for an evil cause will have a share in its burden. And Allah is Ever All-Able to do (and also an All-Witness to) everything.

source: وإذا حييتم بتحية فحيوا بأحسن منها أو ردوها إن الله كان على كل شيء حسيبا
en: When you are greeted with a greeting, greet in return with what is better than it, or (at least) return it equally. Certainly, Allah is Ever a Careful Account Taker of all things.

source: الله لا إله إلا هو ليجمعنكم إلى يوم القيامة لا ريب فيه ومن أصدق من الله حديثا
en: Allah! La ilaha illa Huwa (none has the right to be worshipped but He). Surely, He will gather you together on the Day of Resurrection about which there is no doubt. And who is truer in statement than Allah?

source: فما لكم في المنافقين فئتين والله أركسهم بما كسبوا أتريدون أن تهدوا من أضل الله ومن يضلل الله فلن تجد له سبيلا
en: Then what is the matter with you that you are divided into two parties about the hypocrites? Allah has cast them back (to disbelief) because of what they have earned. Do you want to guide him whom Allah has made to go astray? And he whom Allah has made to go astray, you will never find for him any way (of guidance).

source: ودوا لو تكفرون كما كفروا فتكونون سواء فلا تتخذوا منهم أولياء حتى يهاجروا في سبيل الله فإن تولوا فخذوهم واقتلوهم حيث وجدتموهم ولا تتخذوا منهم وليا ولا نصيرا
en: They wish that you reject Faith, as they have rejected (Faith), and thus that you all become equal (like one another). So take not Auliya' (protectors or friends) from them, till they emigrate in the Way of Allah (to Muhammad صلى الله عليه وسلم). But if they turn back (from Islam), take (hold of) them and kill them wherever you find them, and take neither Auliya' (protectors or friends) nor helpers from them.

source: إلا الذين يصلون إلى قوم بينكم وبينهم ميثاق أو جاءوكم حصرت صدورهم أن يقاتلوكم أو يقاتلوا قومهم ولو شاء الله لسلطهم عليكم فلقاتلوكم فإن اعتزلوكم فلم يقاتلوكم وألقوا إليكم السلم فما جعل الله لكم عليهم سبيلا
en: Except those who join a group, between you and whom there is a treaty (of peace), or those who approach you with their breasts restraining from fighting you as well as fighting their own people. Had Allah willed, indeed He would have given them power over you, and they would have fought you. So if they withdraw from you, and fight not against you, and offer you peace, then Allah has opened no way for you against them.

source: ستجدون آخرين يريدون أن يأمنوكم ويأمنوا قومهم كل ما ردوا إلى الفتنة أركسوا فيها فإن لم يعتزلوكم ويلقوا إليكم السلم ويكفوا أيديهم فخذوهم واقتلوهم حيث ثقفتموهم وأولئكم جعلنا لكم عليهم سلطانا مبينا
en: You will find others that wish to have security from you and security from their people. Every time they are sent back to temptation, they yield thereto. If they withdraw not from you, nor offer you peace, nor restrain their hands, take (hold of) them and kill them wherever you find them. In their case, We have provided you with a clear warrant against them.

source: وما كان لمؤمن أن يقتل مؤمنا إلا خطأ ومن قتل مؤمنا خطأ فتحرير رقبة مؤمنة ودية مسلمة إلى أهله إلا أن يصدقوا فإن كان من قوم عدو لكم وهو مؤمن فتحرير رقبة مؤمنة وإن كان من قوم بينكم وبينهم ميثاق فدية مسلمة إلى أهله وتحرير رقبة مؤمنة فمن لم يجد فصيام شهرين متتابعين توبة من الله وكان الله عليما حكيما
en: It is not for a believer to kill a believer except (that it be) by mistake; and whosoever kills a believer by mistake, (it is ordained that) he must set free a believing slave and a compensation (blood-money, i.e. Diya) be given to the deceased's family unless they remit it. If the deceased belonged to a people at war with you and he was a believer, the freeing of a believing slave (is prescribed); and if he belonged to a people with whom you have a treaty of mutual alliance, compensation (blood-money - Diya) must be paid to his family, and a believing slave must be freed. And whoso finds this (the penance of freeing a slave) beyond his means, he must fast for two consecutive months in order to seek repentance from Allah. And Allah is Ever All-Knowing, All-Wise.

source: ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خالدا فيها وغضب الله عليه ولعنه وأعد له عذابا عظيما
en: And whoever kills a believer intentionally, his recompense is Hell to abide therein; and the Wrath and the Curse of Allah are upon him, and a great punishment is prepared for him.

source: يا أيها الذين آمنوا إذا ضربتم في سبيل الله فتبينوا ولا تقولوا لمن ألقى إليكم السلام لست مؤمنا تبتغون عرض الحياة الدنيا فعند الله مغانم كثيرة كذلك كنتم من قبل فمن الله عليكم فتبينوا إن الله كان بما تعملون خبيرا
en: O you who believe! When you go (to fight) in the Cause of Allah, verify (the truth), and say not to anyone who greets you (by embracing Islam): "You are not a believer"; seeking the perishable goods of the worldly life. There are much more profits and booties with Allah. Even as he is now, so were you yourselves before till Allah conferred on you His Favours (i.e. guided you to Islam), therefore, be cautious in discrimination. Allah is Ever Well-Aware of what you do.

source: لا يستوي القاعدون من المؤمنين غير أولي الضرر والمجاهدون في سبيل الله بأموالهم وأنفسهم فضل الله المجاهدين بأموالهم وأنفسهم على القاعدين درجة وكلا وعد الله الحسنى وفضل الله المجاهدين على القاعدين أجرا عظيما
en: Not equal are those of the believers who sit (at home), except those who are disabled (by injury or are blind or lame), and those who strive hard and fight in the Cause of Allah with their wealth and their lives. Allah has preferred in grades those who strive hard and fight with their wealth and their lives above those who sit (at home). Unto each, Allah has promised good (Paradise), but Allah has preferred those who strive hard and fight, above those who sit (at home) by a huge reward.

source: درجات منه ومغفرة ورحمة وكان الله غفورا رحيما
en: Degrees of (higher) grades from Him, and Forgiveness and Mercy. And Allah is Ever Oft-Forgiving, Most Merciful.

source: إن الذين توفاهم الملائكة ظالمي أنفسهم قالوا فيم كنتم قالوا كنا مستضعفين في الأرض قالوا ألم تكن أرض الله واسعة فتهاجروا فيها فأولئك مأواهم جهنم وساءت مصيرا
en: Verily! As for those whom the angels take (in death) while they are wronging themselves (as they stayed among the disbelievers even though emigration was obligatory for them), they (angels) say (to them): "In what (condition) were you?" They reply: "We were weak and oppressed on the earth." They (angels) say: "Was not the earth of Allah spacious enough for you to emigrate therein?" Such men will find their abode in Hell - What an evil destination!

source: إلا المستضعفين من الرجال والنساء والولدان لا يستطيعون حيلة ولا يهتدون سبيلا
en: Except the weak ones among men, women and children who cannot devise a plan, nor are they able to direct their way.

source: فأولئك عسى الله أن يعفو عنهم وكان الله عفوا غفورا
en: These are they whom Allah is likely to forgive them, and Allah is Ever Oft-Pardoning, Oft-Forgiving.

source: ومن يهاجر في سبيل الله يجد في الأرض مراغما كثيرا وسعة ومن يخرج من بيته مهاجرا إلى الله ورسوله ثم يدركه الموت فقد وقع أجره على الله وكان الله غفورا رحيما
en: He who emigrates (from his home) in the Cause of Allah, will find on earth many dwelling places and plenty to live by. And whosoever leaves his home as an emigrant unto Allah and His Messenger, and death overtakes him, his reward is then surely incumbent upon Allah. And Allah is Ever Oft-Forgiving, Most Merciful.

source: وإذا ضربتم في الأرض فليس عليكم جناح أن تقصروا من الصلاة إن خفتم أن يفتنكم الذين كفروا إن الكافرين كانوا لكم عدوا مبينا
en: And when you (Muslims) travel in the land, there is no sin on you if you shorten As-Salat (the prayer) if you fear that the disbelievers may put you in trial (attack you etc.), verily, the disbelievers are ever unto you open enemies.

source: وإذا كنت فيهم فأقمت لهم الصلاة فلتقم طائفة منهم معك وليأخذوا أسلحتهم فإذا سجدوا فليكونوا من ورائكم ولتأت طائفة أخرى لم يصلوا فليصلوا معك وليأخذوا حذرهم وأسلحتهم ود الذين كفروا لو تغفلون عن أسلحتكم وأمتعتكم فيميلون عليكم ميلة واحدة ولا جناح عليكم إن كان بكم أذى من مطر أو كنتم مرضى أن تضعوا أسلحتكم وخذوا حذركم إن الله أعد للكافرين عذابا مهينا
en: When you (O Messenger Muhammad صلى الله عليه وسلم) are among them, and lead them in As-Salat (the prayer), let one party of them stand up [in Salat (prayer)] with you taking their arms with them; when they finish their prostrations, let them take their positions in the rear and let the other party come up which have not yet prayed, and let them pray with you taking all the precautions and bearing arms. Those who disbelieve wish, if you were negligent of your arms and your baggage, to attack you in a single rush, but there is no sin on you if you put away your arms because of the inconvenience of rain or because you are ill, but take every precaution for yourselves. Verily, Allah has prepared a humiliating torment for the disbelievers.

source: فإذا قضيتم الصلاة فاذكروا الله قياما وقعودا وعلى جنوبكم فإذا اطمأننتم فأقيموا الصلاة إن الصلاة كانت على المؤمنين كتابا موقوتا
en: When you have finished As-Salat (the congregational prayer), remember Allah standing, sitting down, and (lying down) on your sides, but when you are free from danger, perform As-Salat (Iqamat-as-Salat). Verily, As-Salat (the prayer) is enjoined on the believers at fixed hours.

source: ولا تهنوا في ابتغاء القوم إن تكونوا تألمون فإنهم يألمون كما تألمون وترجون من الله ما لا يرجون وكان الله عليما حكيما
en: And don't be weak in the pursuit of the enemy; if you are suffering (hardships) then surely, they (too) are suffering (hardships) as you are suffering, but you have a hope from Allah (for the reward, i.e. Paradise) that for which they hope not; and Allah is Ever All-Knowing, All-Wise.

source: إنا أنزلنا إليك الكتاب بالحق لتحكم بين الناس بما أراك الله ولا تكن للخائنين خصيما
en: Surely, We have sent down to you (O Muhammad صلى الله عليه وسلم) the Book (this Qur'an) in truth that you might judge between men by that which Allah has shown you (i.e. has taught you through Divine Revelation), so be not a pleader for the treacherous.

source: واستغفر الله إن الله كان غفورا رحيما
en: And seek the Forgiveness of Allah, certainly, Allah is Ever Oft-Forgiving, Most Merciful.

source: ولا تجادل عن الذين يختانون أنفسهم إن الله لا يحب من كان خوانا أثيما
en: And argue not on behalf of those who deceive themselves. Verily, Allah does not like anyone who is a betrayer, sinner.

source: يستخفون من الناس ولا يستخفون من الله وهو معهم إذ يبيتون ما لا يرضى من القول وكان الله بما يعملون محيطا
en: They may hide (their crimes) from men, but they cannot hide (them) from Allah; for He is with them (by His Knowledge), when they plot by night in words that He does not approve. And Allah ever encompasses what they do.

source: ها أنتم هؤلاء جادلتم عنهم في الحياة الدنيا فمن يجادل الله عنهم يوم القيامة أم من يكون عليهم وكيلا
en: Lo! You are those who have argued for them in the life of this world, but who will argue for them on the Day of Resurrection against Allah, or who will then be their defender?

source: ومن يعمل سوءا أو يظلم نفسه ثم يستغفر الله يجد الله غفورا رحيما
en: And whoever does evil or wrongs himself but afterwards seeks Allah's Forgiveness, he will find Allah Oft-Forgiving, Most Merciful.

source: ومن يكسب إثما فإنما يكسبه على نفسه وكان الله عليما حكيما
en: And whoever earns sin, he earns it only against himself. And Allah is Ever All-Knowing, All-Wise.

source: ومن يكسب خطيئة أو إثما ثم يرم به بريئا فقد احتمل بهتانا وإثما مبينا
en: And whoever earns a fault or a sin and then throws it on to someone innocent, he has indeed burdened himself with falsehood and a manifest sin.
